Tekla Open API Reference for Tekla Structures 2025
Identifier.ToString Method
 Returns the integer ID as a string.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The integer ID as a string.
See Also
Reference
Identifier Class
Tekla.Structures Namespace